{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Defaulting to user installation because normal site-packages is not writeable\n",
      "Collecting SPARQLWrapper\n",
      "  Downloading SPARQLWrapper-1.8.5-py3-none-any.whl (26 kB)\n",
      "Requirement already satisfied: rdflib>=4.0 in /home/spc93/.local/lib/python3.7/site-packages (from SPARQLWrapper) (5.0.0)\n",
      "Requirement already satisfied: pyparsing in /dls_sw/apps/python/anaconda/4.6.14/64/envs/python3.7/lib/python3.7/site-packages (from rdflib>=4.0->SPARQLWrapper) (2.4.0)\n",
      "Requirement already satisfied: six in /dls_sw/apps/python/anaconda/4.6.14/64/envs/python3.7/lib/python3.7/site-packages (from rdflib>=4.0->SPARQLWrapper) (1.12.0)\n",
      "Requirement already satisfied: isodate in /dls_sw/apps/python/anaconda/4.6.14/64/envs/python3.7/lib/python3.7/site-packages (from rdflib>=4.0->SPARQLWrapper) (0.6.0)\n",
      "Installing collected packages: SPARQLWrapper\n",
      "Successfully installed SPARQLWrapper-1.8.5\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "#pip install SPARQLWrapper"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Asturias\n",
      "منطقة أشتورية\n",
      "Astúries\n",
      "Asturie\n",
      "Asturien\n",
      "Αστούριες\n",
      "Asturio\n",
      "Asturias\n",
      "Asturiasko Printzerria\n",
      "Asturies\n",
      "Asturias\n",
      "Asturias\n",
      "アストゥリアス州\n",
      "Asturie\n",
      "아스투리아스 지방\n",
      "Asturië (regio)\n",
      "Asturia\n",
      "Astúrias\n",
      "Астурия\n",
      "Asturien\n",
      "Астурія\n",
      "阿斯图里亚斯\n"
     ]
    }
   ],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "sparql.setQuery(\"\"\"\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    SELECT ?label\n",
    "    WHERE { <http://dbpedia.org/resource/Asturias> rdfs:label ?label }\n",
    "\"\"\")\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert() ############ the slow bit\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    print(result[\"label\"][\"value\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "England\n",
      "إنجلترا\n",
      "Anglaterra\n",
      "Anglie\n",
      "England\n",
      "Αγγλία\n",
      "Anglio\n",
      "Inglaterra\n",
      "Ingalaterra\n",
      "Angleterre\n",
      "Sasana\n",
      "Inggris\n",
      "Inghilterra\n",
      "イングランド\n",
      "잉글랜드\n",
      "Anglia\n",
      "Inglaterra\n",
      "Англия\n",
      "England\n",
      "Англія\n",
      "英格兰\n"
     ]
    }
   ],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "sparql.setQuery(\"\"\"\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    SELECT ?label\n",
    "    WHERE { <http://dbpedia.org/resource/England> rdfs:label ?label }\n",
    "\"\"\")\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert() ############ the slow bit\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    print(result[\"label\"][\"value\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://rdf.freebase.com/ns/m.02l7x\n",
      "http://es.dbpedia.org/resource/Electrón\n",
      "http://be.dbpedia.org/resource/Электрон\n",
      "http://cs.dbpedia.org/resource/Elektron\n",
      "http://cv.dbpedia.org/resource/Электрон\n",
      "http://tt.dbpedia.org/resource/Электрон\n",
      "http://ga.dbpedia.org/resource/Leictreon\n",
      "http://qu.dbpedia.org/resource/Iliktrun\n",
      "http://uz.dbpedia.org/resource/Elektron\n",
      "http://d-nb.info/gnd/4125978-6\n",
      "http://fi.dbpedia.org/resource/Elektroni\n",
      "http://bs.dbpedia.org/resource/Elektron\n",
      "http://war.dbpedia.org/resource/Electron\n",
      "http://la.dbpedia.org/resource/Electron\n",
      "http://sr.dbpedia.org/resource/Електрон\n",
      "http://io.dbpedia.org/resource/Elektrono\n",
      "http://pa.dbpedia.org/resource/ਬਿਜਲਾਣੂ\n",
      "http://lt.dbpedia.org/resource/Elektronas\n",
      "http://th.dbpedia.org/resource/อิเล็กตรอน\n",
      "http://or.dbpedia.org/resource/ଇଲେକ୍‌ଟ୍ରୋନ\n",
      "http://ml.dbpedia.org/resource/ഇലക്ട്രോൺ\n",
      "http://ko.dbpedia.org/resource/전자\n",
      "http://ka.dbpedia.org/resource/ელექტრონი\n",
      "http://bn.dbpedia.org/resource/ইলেকট্রন\n",
      "http://azb.dbpedia.org/resource/الکترون\n",
      "http://ia.dbpedia.org/resource/Electron\n",
      "http://si.dbpedia.org/resource/ඉලෙක්ට්‍රෝනය\n",
      "http://hi.dbpedia.org/resource/इलेक्ट्रॉन\n",
      "http://lb.dbpedia.org/resource/Elektron\n",
      "http://tl.dbpedia.org/resource/Elektron\n",
      "http://sk.dbpedia.org/resource/Elektrón\n",
      "http://ht.dbpedia.org/resource/Elektwon\n",
      "https://global.dbpedia.org/id/127AwK\n",
      "http://ky.dbpedia.org/resource/Электрон\n",
      "http://ta.dbpedia.org/resource/எதிர்மின்னி\n",
      "http://lmo.dbpedia.org/resource/Elettron\n",
      "http://mk.dbpedia.org/resource/Електрон\n",
      "http://eu.dbpedia.org/resource/Elektroi\n",
      "http://simple.dbpedia.org/resource/Electron\n",
      "http://gu.dbpedia.org/resource/ઈલેક્ટ્રોન\n",
      "http://fy.dbpedia.org/resource/Elektron\n",
      "http://id.dbpedia.org/resource/Elektron\n",
      "http://li.dbpedia.org/resource/Elektron\n",
      "http://hy.dbpedia.org/resource/Էլեկտրոն\n",
      "http://ar.dbpedia.org/resource/إلكترون\n",
      "http://da.dbpedia.org/resource/Elektron\n",
      "http://als.dbpedia.org/resource/Elektron\n",
      "http://ba.dbpedia.org/resource/Электрон\n",
      "http://an.dbpedia.org/resource/Electrón\n",
      "http://pt.dbpedia.org/resource/Elétron\n",
      "http://lv.dbpedia.org/resource/Elektrons\n",
      "http://fr.dbpedia.org/resource/Électron\n",
      "http://vec.dbpedia.org/resource/Ełetron\n",
      "http://uk.dbpedia.org/resource/Електрон\n",
      "http://hr.dbpedia.org/resource/Elektron\n",
      "http://br.dbpedia.org/resource/Elektron\n",
      "http://eo.dbpedia.org/resource/Elektrono\n",
      "http://scn.dbpedia.org/resource/Elettrùni\n",
      "http://ckb.dbpedia.org/resource/ئەلێکتڕۆن\n",
      "http://sw.dbpedia.org/resource/Elektroni\n",
      "http://jv.dbpedia.org/resource/Èlèktron\n",
      "http://yo.dbpedia.org/resource/Ẹ̀lẹ́ktrọ́nù\n",
      "http://gl.dbpedia.org/resource/Electrón\n",
      "http://sh.dbpedia.org/resource/Elektron\n",
      "http://bg.dbpedia.org/resource/Електрон\n",
      "http://sco.dbpedia.org/resource/Electron\n",
      "http://pms.dbpedia.org/resource/Eletron\n",
      "http://ro.dbpedia.org/resource/Electron\n",
      "http://my.dbpedia.org/resource/အီလက်ထရွန်\n",
      "http://sq.dbpedia.org/resource/Elektroni\n",
      "http://et.dbpedia.org/resource/Elektron\n",
      "http://nds.dbpedia.org/resource/Elektron\n",
      "http://el.dbpedia.org/resource/Ηλεκτρόνιο\n",
      "http://pnb.dbpedia.org/resource/الیکٹران\n",
      "http://su.dbpedia.org/resource/Éléktron\n",
      "http://az.dbpedia.org/resource/Elektron\n",
      "http://tr.dbpedia.org/resource/Elektron\n",
      "http://mr.dbpedia.org/resource/विजाणू\n",
      "http://d-nb.info/gnd/4125978-6/about/rdf\n",
      "http://www.wikidata.org/entity/Q2225\n",
      "http://ms.dbpedia.org/resource/Elektron\n",
      "http://mn.dbpedia.org/resource/Электрон\n",
      "http://bar.dbpedia.org/resource/Elektron\n",
      "http://fa.dbpedia.org/resource/الکترون\n",
      "http://oc.dbpedia.org/resource/Electron\n",
      "http://it.dbpedia.org/resource/Elettrone\n",
      "http://kn.dbpedia.org/resource/ಎಲೆಕ್ಟ್ರಾನ್\n",
      "http://af.dbpedia.org/resource/Elektron\n",
      "http://ur.dbpedia.org/resource/برقیہ\n",
      "http://nn.dbpedia.org/resource/Elektron\n",
      "http://hu.dbpedia.org/resource/Elektron\n",
      "http://he.dbpedia.org/resource/אלקטרון\n",
      "http://te.dbpedia.org/resource/ఎలక్ట్రాన్\n",
      "http://ja.dbpedia.org/resource/電子\n",
      "http://new.dbpedia.org/resource/इलेक्ट्रोन\n",
      "http://no.dbpedia.org/resource/Elektron\n",
      "http://kk.dbpedia.org/resource/Электрон\n",
      "http://ru.dbpedia.org/resource/Электрон\n",
      "http://is.dbpedia.org/resource/Rafeind\n",
      "http://bug.dbpedia.org/resource/Elektron\n",
      "http://sl.dbpedia.org/resource/Elektron\n",
      "http://pl.dbpedia.org/resource/Elektron\n",
      "http://vi.dbpedia.org/resource/Electron\n",
      "http://nl.dbpedia.org/resource/Elektron\n",
      "http://ast.dbpedia.org/resource/Electrón\n",
      "http://ca.dbpedia.org/resource/Electró\n",
      "http://de.dbpedia.org/resource/Elektron\n",
      "http://fo.dbpedia.org/resource/Elektron\n",
      "http://ku.dbpedia.org/resource/Kareba\n",
      "http://sv.dbpedia.org/resource/Elektron\n",
      "http://ne.dbpedia.org/resource/इलेक्ट्रोन\n",
      "http://yi.dbpedia.org/resource/עלעקטראן\n"
     ]
    }
   ],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "sparql.setQuery(\"\"\"\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    SELECT ?same\n",
    "    WHERE { <http://dbpedia.org/resource/Electron> owl:sameAs ?same }\n",
    "\"\"\")\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert() ############ the slow bit\n",
    "\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    print(result[\"same\"][\"value\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7 [Conda DLS]",
   "language": "python",
   "name": "conda-env-Conda_DLS-python3.7"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
